MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EFM32GG12B530F512GQ64/mcu.h
  uint32_t       RESERVED17[3U];      /**< Reserved for future use **/
  __IM uint32_t  SYNCBUSY;            /**< Synchronization Busy Register  */
  __IOM uint32_t FREEZE;              /**< Freeze Register  */
  uint32_t       RESERVED18[2U];      /**< Reserved for future use **/
  __IOM uint32_t PCNTCTRL;            /**< PCNT Control Register  */

  uint32_t       RESERVED19[2U];      /**< Reserved for future use **/
  __IOM uint32_t ADCCTRL;             /**< ADC Control Register  */

  uint32_t       RESERVED20[2U];      /**< Reserved for future use **/
  __IOM uint32_t PDMCTRL;             /**< PDM Control Register  */
  uint32_t       RESERVED21[1U];      /**< Reserved for future use **/
  __IOM uint32_t ROUTEPEN;            /**< I/O Routing Pin Enable Register  */
  __IOM uint32_t ROUTELOC0;           /**< I/O Routing Location Register  */
  __IOM uint32_t ROUTELOC1;           /**< I/O Routing Location Register  */
  uint32_t       RESERVED22[1U];      /**< Reserved for future use **/
  __IOM uint32_t LOCK;                /**< Configuration Lock Register  */
  __IOM uint32_t HFRCOSS;             /**< HFRCO Spread Spectrum Register  */
} CMU_TypeDef;                        /** @} */

// #include "efm32gg12b_crypto.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_lesense_st.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_lesense_buf.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_lesense_ch.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_lesense.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_ebi.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_pdm.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_gpio_p.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_gpio.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_prs_ch.h"  // Note: Changed for MikroE implementation.

/***************************************************************************//**
 * @defgroup EFM32GG12B530F512GQ64_PRS PRS
 * @{
 * @brief EFM32GG12B530F512GQ64_PRS Register Declaration
 ******************************************************************************/
/** PRS Register Declaration */
typedef struct {
  __IOM uint32_t SWPULSE;       /**< Software Pulse Register  */
  __IOM uint32_t SWLEVEL;       /**< Software Level Register  */
  __IOM uint32_t ROUTEPEN;      /**< I/O Routing Pin Enable Register  */
  uint32_t       RESERVED0[1U]; /**< Reserved for future use **/
  __IOM uint32_t ROUTELOC0;     /**< I/O Routing Location Register  */
  __IOM uint32_t ROUTELOC1;     /**< I/O Routing Location Register  */
  __IOM uint32_t ROUTELOC2;     /**< I/O Routing Location Register  */
  __IOM uint32_t ROUTELOC3;     /**< I/O Routing Location Register  */

  uint32_t       RESERVED1[4U]; /**< Reserved for future use **/
  __IOM uint32_t CTRL;          /**< Control Register  */
  __IOM uint32_t DMAREQ0;       /**< DMA Request 0 Register  */
  __IOM uint32_t DMAREQ1;       /**< DMA Request 1 Register  */
  uint32_t       RESERVED2[1U]; /**< Reserved for future use **/
  __IM uint32_t  PEEK;          /**< PRS Channel Values  */

  uint32_t       RESERVED3[3U]; /**< Reserved registers */
  PRS_CH_TypeDef CH[16U];       /**< Channel registers */
} PRS_TypeDef;                  /** @} */

// #include "efm32gg12b_ldma_ch.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_ldma.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_fpueh.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_gpcrc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_can_mir.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_can.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_timer_cc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_timer.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_usart.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_leuart.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_letimer.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_cryotimer.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_pcnt.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_i2c.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_adc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_acmp.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_vdac_opa.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_vdac.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_idac.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_csen.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_lcd.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_rtc_comp.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_rtc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_rtcc_cc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_rtcc_ret.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_rtcc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_wdog_pch.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_wdog.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_etm.h"  // Note: Changed for MikroE implementation.

/***************************************************************************//**
 * @defgroup EFM32GG12B530F512GQ64_SMU SMU
 * @{
 * @brief EFM32GG12B530F512GQ64_SMU Register Declaration
 ******************************************************************************/
/** SMU Register Declaration */
typedef struct {
  uint32_t       RESERVED0[3U];  /**< Reserved for future use **/
  __IM uint32_t  IF;             /**< Interrupt Flag Register  */
  __IOM uint32_t IFS;            /**< Interrupt Flag Set Register  */
  __IOM uint32_t IFC;            /**< Interrupt Flag Clear Register  */
  __IOM uint32_t IEN;            /**< Interrupt Enable Register  */

